-- Предположим, мы хотим для каждого сотрудника увидеть, сколько процентов составляет его зарплата от общего фонда труда по городу. 
-- Напишите запрос, который это сделает.

SELECT
    name,
    city,
    salary,
    sum(salary) OVER w as fund,
    round(salary * 100/sum(salary) OVER w) AS perc
FROM employees
WINDOW w AS (partition by city)
ORDER BY city, salary, id;


-- Query result:
-- +----------+--------+--------+------+------+
-- | name     | city   | salary | fund | perc |
-- +----------+--------+--------+------+------+
-- | Ксения   | Москва | 90     | 510  | 18   |
-- | Вероника | Москва | 96     | 510  | 19   |
-- | Анна     | Москва | 100    | 510  | 20   |
-- | Марина   | Москва | 104    | 510  | 20   |
-- | Иван     | Москва | 120    | 510  | 24   |
-- | Дарья    | Самара | 70     | 432  | 16   |
-- | Борис    | Самара | 78     | 432  | 18   |
-- | Елена    | Самара | 84     | 432  | 19   |
-- | Григорий | Самара | 96     | 432  | 22   |
-- | Леонид   | Самара | 104    | 432  | 24   |
-- +----------+--------+--------+------+------+