-- Предположим, мы хотим рассчитать скользящее среднее по доходам за предыдущий и текущий месяц.
-- Напишите запрос, который это сделает.

SELECT
    year,
    month,
    income,
    round(avg(income) OVER w) AS roll_avg
FROM expenses
WINDOW w AS (
             ORDER BY year, month
             ROWS BETWEEN 1 PRECEDING AND CURRENT ROW
            )
ORDER BY year, month;


-- Query result:
-- +------+-------+--------+----------+
-- | year | month | income | roll_avg |
-- +------+-------+--------+----------+
-- | 2020 | 1     | 94     | 94       |
-- | 2020 | 2     | 94     | 94       |
-- | 2020 | 3     | 94     | 94       |
-- | 2020 | 4     | 100    | 97       |
-- | 2020 | 5     | 100    | 100      |
-- | 2020 | 6     | 100    | 100      |
-- | 2020 | 7     | 100    | 100      |
-- | 2020 | 8     | 100    | 100      |
-- | 2020 | 9     | 104    | 102      |
-- +------+-------+--------+----------+ 