-- Предположим, мы хотим для каждого сотрудника увидеть:
-- сколько человек трудится в его отделе (emp_cnt);
-- какая средняя зарплата по отделу (sal_avg);
-- на сколько процентов отклоняется его зарплата от средней по отделу (diff).
-- Напишите запрос, который это сделает. 

SELECT
    name,
    department,
    salary,
    count(*) OVER w AS emp_cnt,
    round(avg(salary) OVER w) AS sal_avg,
    round((salary - avg(salary) OVER w)/avg(salary) OVER w * 100) AS diff
FROM employees
WINDOW w AS (partition by department)
ORDER BY department, id;


-- Query result:
-- +----------+------------+--------+---------+---------+------+
-- | name     | department | salary | emp_cnt | sal_avg | diff |
-- +----------+------------+--------+---------+---------+------+
-- | Дарья    | hr         | 70     | 2       | 74      | -5   |
-- | Борис    | hr         | 78     | 2       | 74      | 5    |
-- | Елена    | it         | 84     | 5       | 100     | -16  |
-- | Ксения   | it         | 90     | 5       | 100     | -10  |
-- | Леонид   | it         | 104    | 5       | 100     | 4    |
-- | Марина   | it         | 104    | 5       | 100     | 4    |
-- | Иван     | it         | 120    | 5       | 100     | 20   |
-- | Вероника | sales      | 96     | 3       | 97      | -1   |
-- | Григорий | sales      | 96     | 3       | 97      | -1   |
-- | Анна     | sales      | 100    | 3       | 97      | 3    |
-- +----------+------------+--------+---------+---------+------+