-- Посчитайте скользящую среднюю выручку за 3 месяца для тарифа platinum в 2020 году.
-- Округлите среднюю выручку до целого.

SELECT
    year,
    month,
    revenue,
    round(avg(revenue) OVER w) AS avg3m
FROM sales
WHERE year = 2020 AND plan = 'platinum'
WINDOW w AS (
             ORDER BY month
             ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING
            )
ORDER BY month;


-- Query result:
-- +------+-------+---------+-------+
-- | year | month | revenue | avg3m |
-- +------+-------+---------+-------+
-- | 2020 | 1     | 7200    | 10200 |
-- | 2020 | 2     | 13200   | 12400 |
-- | 2020 | 3     | 16800   | 18400 |
-- | 2020 | 4     | 25200   | 22000 |
-- | 2020 | 5     | 24000   | 27200 |
-- | 2020 | 6     | 32400   | 28400 |
-- | 2020 | 7     | 28800   | 24800 |
-- | 2020 | 8     | 13200   | 18600 |
-- | 2020 | 9     | 13800   | 15000 |
-- | 2020 | 10    | 18000   | 22600 |
-- | 2020 | 11    | 36000   | 25000 |
-- | 2020 | 12    | 21000   | 28500 |
-- +------+-------+---------+-------+