-- Есть таблица сотрудников employees. Предположим, для каждого человека мы хотим определить максимальную зарплату среди тех, 
-- у кого зарплата на 10–30 тыс. ₽ меньше чем у него. Напишите запрос, который это сделает.

SELECT
    id,
    name,
    salary,
    max(salary) OVER w as lower_sal
FROM employees
WINDOW w AS (
             ORDER BY salary
             RANGE BETWEEN 30 PRECEDING AND 10 PRECEDING
            )
ORDER BY salary, id;


-- Query result:
-- +----+----------+--------+-----------+
-- | id | name     | salary | lower_sal |
-- +----+----------+--------+-----------+
-- | 11 | Дарья    | 70     | NULL      |
-- | 12 | Борис    | 78     | NULL      |
-- | 21 | Елена    | 84     | 70        |
-- | 22 | Ксения   | 90     | 78        |
-- | 31 | Вероника | 96     | 84        |
-- | 32 | Григорий | 96     | 84        |
-- | 33 | Анна     | 100    | 90        |
-- | 23 | Леонид   | 104    | 90        |
-- | 24 | Марина   | 104    | 90        |
-- | 25 | Иван     | 120    | 104       |
-- +----+----------+--------+-----------+
