-- Посчитайте выручку по месяцам для тарифа silver. Для каждого месяца дополнительно укажите:
-- * выручку за декабрь этого же года (december);
-- * процент, который составляет выручка текущего месяца от december (perc).
-- Процент округлите до целого.

SELECT
    year,
    month,
    revenue,
    last_value(revenue) OVER w AS december,
    round(revenue * 100 / last_value(revenue) OVER w) AS perc
FROM sales
WHERE plan = 'silver'
WINDOW w AS (
             PARTITION BY year
             ORDER BY month
             ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
            )
ORDER BY year, month;

-- Query result:
-- +------+-------+---------+----------+------+
-- | year | month | revenue | december | perc |
-- +------+-------+---------+----------+------+
-- | 2019 | 1     | 12000   | 26400    | 45   |
-- | 2019 | 2     | 39600   | 26400    | 150  |
-- | 2019 | 3     | 24000   | 26400    | 91   |
-- | 2019 | 4     | 18000   | 26400    | 68   |
-- | 2019 | 5     | 26400   | 26400    | 100  |
-- | 2019 | 6     | 32400   | 26400    | 123  |
-- | 2019 | 7     | 26400   | 26400    | 100  |
-- | 2019 | 8     | 26400   | 26400    | 100  |
-- | 2019 | 9     | 15000   | 26400    | 57   |
-- | 2019 | 10    | 25200   | 26400    | 95   |
-- | 2019 | 11    | 29700   | 26400    | 113  |
-- | 2019 | 12    | 26400   | 26400    | 100  |
-- | 2020 | 1     | 27000   | 66000    | 41   |
-- | 2020 | 2     | 61200   | 66000    | 93   |
-- | 2020 | 3     | 42000   | 66000    | 64   |
-- | 2020 | 4     | 42000   | 66000    | 64   |
-- | 2020 | 5     | 39000   | 66000    | 59   |
-- | 2020 | 6     | 52800   | 66000    | 80   |
-- | 2020 | 7     | 46800   | 66000    | 71   |
-- | 2020 | 8     | 33000   | 66000    | 50   |
-- | 2020 | 9     | 54000   | 66000    | 82   |
-- | 2020 | 10    | 57000   | 66000    | 86   |
-- | 2020 | 11    | 62700   | 66000    | 95   |
-- | 2020 | 12    | 66000   | 66000    | 100  |
-- +------+-------+---------+----------+------+