-- Задание
-- В таблице book необходимо скорректировать значение для покупателя в столбце buy таким образом, чтобы оно не превышало
-- количество экземпляров книг, указанных в столбце amount. А цену тех книг, которые покупатель не заказывал, снизить на 10%.

-- Структура и наполнение таблицы book
-- +---------+-----------------------+------------------+--------+--------+-----+
-- | book_id | title                 | author           | price  | amount | buy |
-- +---------+-----------------------+------------------+--------+--------+-----+
-- | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      | 0   |
-- | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      | 3   |
-- | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     | 8   |
-- | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      | 0   |
-- | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     | 18  |
-- +---------+-----------------------+------------------+--------+--------+-----+



UPDATE book 
SET 
    price = IF(buy = 0, price * 0.9, price),
    buy = IF(amount - buy < 0, amount, buy);

SELECT * FROM book;

-- Query result:
-- +---------+-----------------------+------------------+--------+--------+-----+
-- | book_id | title                 | author           | price  | amount | buy |
-- +---------+-----------------------+------------------+--------+--------+-----+
-- | 1       | Мастер и Маргарита    | Булгаков М.А.    | 603.89 | 3      | 0   |
-- | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      | 3   |
-- | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     | 8   |
-- | 4       | Братья Карамазовы     | Достоевский Ф.М. | 719.11 | 2      | 0   |
-- | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     | 15  |
-- +---------+-----------------------+------------------+--------+--------+-----+
-- Affected rows: 5