-- Задание
-- Создать новую таблицу back_payment, куда внести информацию о неоплаченных штрафах 
-- (Фамилию и инициалы водителя, номер машины, нарушение, сумму штрафа  и  дату нарушения) из таблицы fine.

-- Структура и наполнение таблицы fine перед выполнением этого шага
-- +---------------+--------+------------------------------+----------+----------------+--------------+
-- | name          | number | violation                    | sum_fine | date_violation | date_payment |
-- |               | _plate |                              |          |                |              |
-- +---------------+--------+------------------------------+----------+----------------+--------------+
-- | Баранов П.Е.  | Р523ВТ | Превышение скорости(от 40... | 500.00   | 2020-01-12     | 2020-01-17   |
-- | Абрамова К.А. | О111АВ | Проезд на запрещающий сигнал | 1000.00  | 2020-01-14     | 2020-02-27   |
-- | Яковлев Г.Р.  | Т330ТТ | Превышение скорости(от 20... | 500.00   | 2020-01-23     | 2020-02-23   |
-- | Яковлев Г.Р.  | М701АА | Превышение скорости(от 20... | 500.00   | 2020-01-12     | None         |
-- | Колесов С.П.  | К892АХ | Превышение скорости(от 20... | 500.00   | 2020-02-01     | None         |
-- | Баранов П.Е.  | Р523ВТ | Превышение скорости(от 40... | 1000.00  | 2020-02-14     | None         |
-- | Абрамова К.А. | О111АВ | Проезд на запрещающий сигн...| 1000.00  | 2020-02-23     | None         |
-- | Яковлев Г.Р.  | Т330ТТ | Проезд на запрещающий сигн...| 1000.00  | 2020-03-03     | None         |
-- +---------------+--------+------------------------------+----------+----------------+--------------+


CREATE TABLE back_payment(
    SELECT name, number_plate, violation, sum_fine, date_violation 
    FROM fine
    WHERE date_payment IS NULL
);

SELECT * FROM back_payment;


-- Query result:
-- +---------------+--------------+----------------------------------+----------+----------------+
-- | name          | number_plate | violation                        | sum_fine | date_violation |
-- +---------------+--------------+----------------------------------+----------+----------------+
-- | Колесов С.П.  | К892АХ       | Превышение скорости(от 20 до 40) | 500.00   | 2020-02-01     |
-- | Абрамова К.А. | О111АВ       | Проезд на запрещающий сигнал     | 2000.00  | 2020-02-23     |
-- +---------------+--------------+----------------------------------+----------+----------------+
-- Affected rows: 2