-- Задание
-- В таблице fine увеличить в два раза сумму неоплаченных штрафов для отобранных на предыдущем шаге записей.

-- Структура и наполнение таблицы fine перед выполнением этого шага
-- +---------------+--------+------------------------------+----------+----------------+--------------+
-- | name          | number | violation                    | sum_fine | date_violation | date_payment |
-- |               | _plate |                              |          |                |              |
-- +---------------+--------+------------------------------+----------+----------------+--------------+
-- | Баранов П.Е.  | Р523ВТ | Превышение скорости(от 40... | 500.00   | 2020-01-12     | 2020-01-17   |
-- | Абрамова К.А. | О111АВ | Проезд на запрещающий сигнал | 1000.00  | 2020-01-14     | 2020-02-27   |
-- | Яковлев Г.Р.  | Т330ТТ | Превышение скорости(от 20... | 500.00   | 2020-01-23     | 2020-02-23   |
-- | Яковлев Г.Р.  | М701АА | Превышение скорости(от 20... | 500.00   | 2020-01-12     | None         |
-- | Колесов С.П.  | К892АХ | Превышение скорости(от 20... | 500.00   | 2020-02-01     | None         |
-- | Баранов П.Е.  | Р523ВТ | Превышение скорости(от 40... | 1000.00  | 2020-02-14     | None         |
-- | Абрамова К.А. | О111АВ | Проезд на запрещающий сигн...| 1000.00  | 2020-02-23     | None         |
-- | Яковлев Г.Р.  | Т330ТТ | Проезд на запрещающий сигн...| 1000.00  | 2020-03-03     | None         |
-- +---------------+--------+------------------------------+----------+----------------+--------------+



UPDATE fine AS fn, 
		(SELECT name, number_plate, violation
		FROM fine
		GROUP BY name, number_plate, violation
		HAVING COUNT(*) >= 2) AS qr
SET fn.sum_fine = fn.sum_fine * 2
WHERE fn.date_payment IS NULL AND fn.name = qr.name;

SELECT name, number_plate, violation, sum_fine, date_violation, date_payment
FROM fine;