-- Задание
-- Вывести в алфавитном порядке всех авторов, которые пишут только в одном жанре. Поскольку у нас в таблицах 
-- так занесены данные, что у каждого автора книги только в одном жанре,  для этого запроса внесем изменения 
-- в таблицу book. Пусть у нас  книга Есенина «Черный человек» относится к жанру «Роман», а книга Булгакова 
-- «Белая гвардия» к «Приключениям» (эти изменения в таблицы уже внесены).

SELECT name_author
FROM author
INNER JOIN book ON author.author_id = book.author_id
GROUP BY name_author
HAVING count(DISTINCT genre_id) = 1;

-- Query result:
-- +------------------+
-- | name_author      |
-- +------------------+
-- | Достоевский Ф.М. |
-- | Пастернак Б.Л.   |
-- +------------------+
-- Affected rows: 2