-- Задание
-- Удалить все жанры, к которым относится меньше 4-х книг. В таблице book для этих жанров установить значение Null.

-- Структура и наполнение таблиц 
-- Таблица book
-- +---------+-----------------------+-----------+----------+--------+--------+
-- | book_id | title                 | author_id | genre_id | price  | amount |
-- +---------+-----------------------+-----------+----------+--------+--------+
-- | 1       | Мастер и Маргарита    | 1         | 1        | 670.99 | 3      |
-- | 2       | Белая гвардия         | 1         | 1        | 540.50 | 12     |
-- | 3       | Идиот                 | 2         | 1        | 437.11 | 13     |
-- | 4       | Братья Карамазовы     | 2         | 1        | 799.01 | 3      |
-- | 5       | Игрок                 | 2         | 1        | 480.50 | 10     |
-- | 6       | Стихотворения и поэмы | 3         | 2        | 650.00 | 15     |
-- | 7       | Черный человек        | 3         | 2        | 570.20 | 12     |
-- | 8       | Лирика                | 4         | 2        | 518.99 | 2      |
-- | 9       | Доктор Живаго         | 4         | 1        | 380.80 | 4      |
-- | 10      | Стихотворения и поэмы | 5         | 2        | 255.90 | 4      |
-- | 11      | Остров сокровищ       | 6         | 3        | 599.99 | 5      |
-- +---------+-----------------------+-----------+----------+--------+--------+

-- Таблица author                          Таблица genre
-- +-----------+------------------+	+----------+-------------+			
-- | author_id | name_author      |	| genre_id | name_genre  |			
-- +-----------+------------------+	+----------+-------------+			
-- | 1         | Булгаков М.А.    |	| 1        | Роман       |			
-- | 2         | Достоевский Ф.М. |	| 2        | Поэзия      |			
-- | 3         | Есенин С.А.      |	| 3        | Приключения |			
-- | 4         | Пастернак Б.Л.   |	+----------+-------------+			
-- | 5         | Лермонтов М.Ю.   |
-- | 6         | Стивенсон Р.Л.   |
-- +-----------+------------------+


DELETE g FROM genre g
INNER JOIN (
    SELECT genre_id
    FROM book
    GROUP BY genre_id
    HAVING COUNT(title) < 3
 ) b
ON g.genre_id = b.genre_id;

SELECT * FROM genre;
SELECT * FROM book;



-- Query result:
-- +----------+------------+
-- | genre_id | name_genre |
-- +----------+------------+
-- | 1        | Роман      |
-- | 2        | Поэзия     |
-- +----------+------------+
-- Affected rows: 2

-- Query result:
-- +---------+-----------------------+-----------+----------+--------+--------+
-- | book_id | title                 | author_id | genre_id | price  | amount |
-- +---------+-----------------------+-----------+----------+--------+--------+
-- | 1       | Мастер и Маргарита    | 1         | 1        | 670.99 | 3      |
-- | 2       | Белая гвардия         | 1         | 1        | 540.50 | 12     |
-- | 3       | Идиот                 | 2         | 1        | 437.11 | 13     |
-- | 4       | Братья Карамазовы     | 2         | 1        | 799.01 | 3      |
-- | 5       | Игрок                 | 2         | 1        | 480.50 | 10     |
-- | 6       | Стихотворения и поэмы | 3         | 2        | 650.00 | 15     |
-- | 7       | Черный человек        | 3         | 2        | 570.20 | 12     |
-- | 8       | Лирика                | 4         | 2        | 518.99 | 2      |
-- | 9       | Доктор Живаго         | 4         | 1        | 380.80 | 4      |
-- | 10      | Стихотворения и поэмы | 5         | 2        | 255.90 | 4      |
-- | 11      | Остров сокровищ       | 6         | NULL     | 599.99 | 5      |
-- +---------+-----------------------+-----------+----------+--------+--------+
-- Affected rows: 11