-- Задание
-- В таблицу buy_step занести дату 12.04.2020 выставления счета на оплату заказа с номером 5.
-- Правильнее было бы занести не конкретную, а текущую дату. Это можно сделать с помощью функции Now(). 
-- Но при этом в разные дни будут вставляться разная дата, и задание нельзя будет проверить, поэтому  
-- вставим дату 12.04.2020.


UPDATE buy_step
SET date_step_beg = '2020-04-12'
WHERE buy_id = 5 AND step_id = (SELECT step_id FROM step WHERE name_step = 'Оплата');

SELECT * FROM buy_step;

-- Query result:
-- +-------------+--------+---------+---------------+---------------+
-- | buy_step_id | buy_id | step_id | date_step_beg | date_step_end |
-- +-------------+--------+---------+---------------+---------------+
-- | 1           | 1      | 1       | 2020-02-20    | 2020-02-20    |
-- | 2           | 1      | 2       | 2020-02-20    | 2020-02-21    |
-- | 3           | 1      | 3       | 2020-02-22    | 2020-03-07    |
-- | 4           | 1      | 4       | 2020-03-06    | 2020-03-06    |
-- | 5           | 2      | 1       | 2020-02-28    | 2020-02-28    |
-- | 6           | 2      | 2       | 2020-02-29    | 2020-03-01    |
-- | 7           | 2      | 3       | 2020-03-02    | NULL          |
-- | 8           | 2      | 4       | NULL          | NULL          |
-- | 9           | 3      | 1       | 2020-03-05    | 2020-03-05    |
-- | 10          | 3      | 2       | 2020-03-05    | 2020-03-06    |
-- | 11          | 3      | 3       | 2020-03-06    | 2020-03-10    |
-- | 12          | 3      | 4       | 2020-03-11    | NULL          |
-- | 13          | 4      | 1       | 2020-03-20    | NULL          |
-- | 14          | 4      | 2       | NULL          | NULL          |
-- | 15          | 4      | 3       | NULL          | NULL          |
-- | 16          | 4      | 4       | NULL          | NULL          |
-- | 17          | 5      | 1       | 2020-04-12    | NULL          |
-- | 18          | 5      | 2       | NULL          | NULL          |
-- | 19          | 5      | 3       | NULL          | NULL          |
-- | 20          | 5      | 4       | NULL          | NULL          |
-- +-------------+--------+---------+---------------+---------------+
-- Affected rows: 20