-- Задание
-- Занести для книги «Стихотворения и поэмы» Лермонтова жанр «Поэзия», 
-- а для книги «Остров сокровищ» Стивенсона - «Приключения». (Использовать два запроса).

 UPDATE book
    SET genre_id = 
        (SELECT genre_id FROM genre
          WHERE name_genre = 'Поэзия')
  WHERE author_id = (SELECT author_id FROM author
          WHERE name_author LIKE 'Лермонтов%');
  UPDATE book
     SET genre_id = 
        (SELECT genre_id FROM genre
          WHERE name_genre = 'Приключения')
  WHERE author_id = (SELECT author_id FROM author
          WHERE name_author LIKE 'Стивенсон%');
SELECT * FROM book 

-- Query result:
-- +---------+-----------------------+-----------+----------+--------+--------+
-- | book_id | title                 | author_id | genre_id | price  | amount |
-- +---------+-----------------------+-----------+----------+--------+--------+
-- | 1       | Мастер и Маргарита    | 1         | 1        | 670.99 | 3      |
-- | 2       | Белая гвардия         | 1         | 1        | 540.50 | 12     |
-- | 3       | Идиот                 | 2         | 1        | 437.11 | 13     |
-- | 4       | Братья Карамазовы     | 2         | 1        | 799.01 | 3      |
-- | 5       | Игрок                 | 2         | 1        | 480.50 | 10     |
-- | 6       | Стихотворения и поэмы | 3         | 2        | 650.00 | 15     |
-- | 7       | Черный человек        | 3         | 2        | 570.20 | 12     |
-- | 8       | Лирика                | 4         | 2        | 518.99 | 2      |
-- | 9       | Доктор Живаго         | 4         | 1        | 380.80 | 4      |
-- | 10      | Стихотворения и поэмы | 5         | 2        | 255.90 | 4      |
-- | 11      | Остров сокровищ       | 6         | 3        | 599.99 | 5      |
-- +---------+-----------------------+-----------+----------+--------+--------+
-- Affected rows: 11

