-- Задание
-- Вывести название, жанр и цену тех книг, количество которых больше 8, в отсортированном по убыванию цены виде.

SELECT title, name_genre, price from book
JOIN genre USING(genre_id)
WHERE amount > 8
ORDER BY price DESC

-- Query result:
-- +-----------------------+------------+--------+
-- | title                 | name_genre | price  |
-- +-----------------------+------------+--------+
-- | Стихотворения и поэмы | Поэзия     | 650.00 |
-- | Игрок                 | Роман      | 480.50 |
-- | Идиот                 | Роман      | 460.00 |
-- +-----------------------+------------+--------+
-- Affected rows: 3