-- Задание
-- Добавить новые книги из таблицы supply в таблицу book на основе сформированного выше запроса. 
-- Затем вывести для просмотра таблицу book.

INSERT INTO book (title, author_id, price, amount)
SELECT title, author_id, price, amount
  FROM author
       JOIN supply
       ON author.name_author = supply.author
 WHERE amount <> 0;

SELECT * FROM book;


-- Query result:
-- +---------+-----------------------+-----------+----------+--------+--------+
-- | book_id | title                 | author_id | genre_id | price  | amount |
-- +---------+-----------------------+-----------+----------+--------+--------+
-- | 1       | Мастер и Маргарита    | 1         | 1        | 670.99 | 3      |
-- | 2       | Белая гвардия         | 1         | 1        | 540.50 | 12     |
-- | 3       | Идиот                 | 2         | 1        | 437.11 | 13     |
-- | 4       | Братья Карамазовы     | 2         | 1        | 799.01 | 3      |
-- | 5       | Игрок                 | 2         | 1        | 480.50 | 10     |
-- | 6       | Стихотворения и поэмы | 3         | 2        | 650.00 | 15     |
-- | 7       | Черный человек        | 3         | 2        | 570.20 | 12     |
-- | 8       | Лирика                | 4         | 2        | 518.99 | 2      |
-- | 9       | Доктор Живаго         | 4         | NULL     | 380.80 | 4      |
-- | 10      | Стихотворения и поэмы | 5         | NULL     | 255.90 | 4      |
-- | 11      | Остров сокровищ       | 6         | NULL     | 599.99 | 5      |
-- +---------+-----------------------+-----------+----------+--------+--------+
-- Affected rows: 11