-- Задание
-- Вывести образовательные программы, для которых минимальный балл ЕГЭ 
-- по каждому предмету больше или равен 40 баллам. Программы вывести в 
-- отсортированном по алфавиту виде.

SELECT name_program
FROM program
	INNER JOIN program_subject USING (program_id)
GROUP BY 1
HAVING MIN(min_result) >= 40
ORDER BY 1;

-- Query result:
-- +-------------------------------------+
-- | name_program                        |
-- +-------------------------------------+
-- | Мехатроника и робототехника         |
-- | Прикладная математика и информатика |
-- +-------------------------------------+