-- Задание
-- Вывести информацию о книгах (название книги, фамилию и инициалы автора, название жанра, цену и количество экземпляров книги), 
-- написанных в самых популярных жанрах, в отсортированном в алфавитном порядке по названию книг виде. 
-- Самым популярным считать жанр, общее количество экземпляров книг которого на складе максимально.


SELECT title, name_author, name_genre, price, amount
FROM genre 
	JOIN book USING(genre_id)
    JOIN author USING(author_id)
WHERE genre_id IN (
    SELECT genre_id
    FROM book 
    GROUP BY genre_id
    HAVING SUM(amount) = (
        SELECT SUM(amount) AS sum_amount
        FROM book
        GROUP BY genre_id
        ORDER BY sum_amount DESC
        LIMIT 1))
ORDER BY title;


-- Query result:
-- +-----------------------+------------------+------------+--------+--------+
-- | title                 | name_author      | name_genre | price  | amount |
-- +-----------------------+------------------+------------+--------+--------+
-- | Белая гвардия         | Булгаков М.А.    | Роман      | 540.50 | 5      |
-- | Братья Карамазовы     | Достоевский Ф.М. | Роман      | 799.01 | 3      |
-- | Игрок                 | Достоевский Ф.М. | Роман      | 480.50 | 10     |
-- | Идиот                 | Достоевский Ф.М. | Роман      | 460.00 | 10     |
-- | Лирика                | Пастернак Б.Л.   | Поэзия     | 518.99 | 10     |
-- | Мастер и Маргарита    | Булгаков М.А.    | Роман      | 670.99 | 3      |
-- | Стихотворения и поэмы | Есенин С.А.      | Поэзия     | 650.00 | 15     |
-- | Черный человек        | Есенин С.А.      | Поэзия     | 570.20 | 6      |
-- +-----------------------+------------------+------------+--------+--------+
-- Affected rows: 8